import animations

ladders_up = [
    (1, 0)
]
ladders_down = [
    (1, 1)
]
doors = [
    (0, 0),
    (3, 0)
]
impasses = [
    (-1, 5),
    (-1, 4),
    (-1, 3),
    (-1, 2),
    (-1, 1), (2, 1),
    (-1, 0), (4, 0),
    (-1, -1),
    (-1, -2),
    (-1, -3),
    (-1, -4),
    (-1, -5)
]
items = {
    (0, 0, 1): ['тестовый_предмет', 150, 150, 100, 200],
    (2, 1, 0): ['тестовый_предмет1', 150, 150, 100, 200]
}
inventory = ['1r', 'вентиль']
puzzles = {
    (2, 0, 0): ['вентиль', 200, 400, 300, 50]
}
puzzles_renders = {
    -1: animations.empty_render,
    'вентиль': animations.steam
}
